# Brewfile.corporate — Air-class machines (16/32GB), work-style use.
# Excludes security/networking tools (nmap, httrack) that corp policies
# often flag. Excludes personal-only apps (discord, wacom-tablet, etc.).
# Switches orbstack -> docker for compatibility on work environments.

# CLI tools — light set
brew "stow"
brew "fzf"
brew "eza"
brew "bat"
brew "ripgrep"
brew "neovim"
brew "lazygit"
brew "gnu-sed"
brew "nvm"
brew "bun"
brew "jq"
brew "xh"
brew "git-delta"
brew "mosh"

# CLI tools — corporate additions
brew "starship"
brew "dasel"
brew "ast-grep"
brew "prettyping"
brew "expect"
brew "awscli"
brew "groff"
brew "gh"
brew "glab"
brew "libpq"
brew "sqlite"
brew "ffmpeg"

# Disabled — documented for awareness, not installed:
# brew "jless"
# brew "jqp"
# brew "kubectl"
# brew "kubectx"
# brew "kubens"
# brew "derailed/k9s/k9s"

# Casks — light set (orbstack replaced by docker below)
cask "kitty"
cask "font-symbols-only-nerd-font"
cask "1password"
cask "1password-cli"
cask "google-chrome"
cask "slack"
cask "zoom"
cask "claude-code"
cask "onlyoffice"

# Casks — corporate additions
cask "docker"
cask "firefox"
cask "dbeaver-community"
cask "raycast"
cask "monitorcontrol"
cask "alt-tab"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "ghostty"
cask "redisinsight"
