# Brewfile.light — minimum install for MacBook Neo (low-spec machine).
# Includes core shell ergonomics, terminal, editor, and the tools the
# user wants present even on the smallest machine.

# CLI tools
brew "stow"
brew "fzf"
brew "eza"
brew "bat"
brew "ripgrep"
brew "neovim"
brew "lazygit"
brew "gnu-sed"
brew "nvm"
brew "bun"
brew "jq"
brew "xh"
brew "git-delta"
brew "mosh"

# Disabled — documented for awareness, not installed:
# brew "jless"
# brew "jqp"

# Casks
cask "kitty"
cask "font-symbols-only-nerd-font"
cask "1password"
cask "1password-cli"
cask "google-chrome"
cask "slack"
cask "zoom"
cask "orbstack"
cask "claude-code"
cask "onlyoffice"
